Modules/Tag/Http/Controllers/Frontend/TagsController.php

select * from `categories` where `categories`.`id` in (1, 2, 4, 5) and `categories`.`deleted_at` is null
---
    public function show($id)
    {
        $id = decode_id($id);

        $module_title = $this->module_title;
        $module_name = $this->module_name;
        $module_path = $this->module_path;
        $module_icon = $this->module_icon;
        $module_model = $this->module_model;
        $module_name_singular = Str::singular($module_name);

        $module_action = 'Show';

        $$module_name_singular = $module_model::findOrFail($id);
        $posts = $$module_name_singular->posts()->with('category', 'tags')->paginate();